content/posts/for_the_sake_of_advancing_ai.md
+++
title = "For the sake of advancing AI"
author = ["Joe Corneli"]
lastmod = 2020-09-12T21:07:39+01:00
slug = "for_the_sake_of_advancing_ai"
draft = false
+++

We are doing this R&D work partly to make demonstrations of more
advanced AI systems.  We expect that our stance on AI will not
necessarily be a popular one.  But this is an important “minor” strand
of AI research dating back to Alan Turing:

> "As time goes on the [computer] itself will take over the functions
> both of [programmers] and of [users]…The [programmers] are liable to
> get replaced because as soon as any technique becomes at all
> stereotyped it becomes possible to devise a system of instruction
> tables which will enable the electronic computer to do it for
> itself. It may happen however that the [programmers] will refuse to do
> this. They may be unwilling to let their jobs be stolen from them in
> this way. In that case they would surround the whole of their work
> with mystery and make excuses, couched in well chosen gibberish,
> whenever any dangerous suggestions were made." -- Alan Turing, 1947.


## Next steps {#next-steps}

-   [Production system]({{< relref "production_system" >}})
